#include <Windows.h>
#include <locale.h>
#include <conio.h>
#include <stdio.h>

void startScreen(void) {
	setlocale(LC_ALL, "Russian");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@               @              @              @              @              @              @              @@\n");
	printf("@@   @       @   @     @@@@@@   @     @@       @     @@@@     @     @@@@     @   @@     @@  @     @@@@@@   @@\n");
	printf("@@   @   @   @   @     @@       @     @@       @    @@        @    @@  @@    @   @ @   @ @  @     @@       @@\n");
	printf("@@    @ @ @ @    @     @@@@@    @     @@       @    @@        @    @@  @@    @   @  @ @  @  @     @@@@@@   @@\n");
	printf("@@    @ @ @ @    @     @@       @     @@       @    @@        @    @@  @@    @   @   @   @  @     @@       @@\n");
	printf("@@     @   @     @     @@@@@@   @     @@@@@    @     @@@@     @     @@@@     @   @       @  @     @@@@@@   @@\n");
	printf("@@               @              @              @              @              @              @              @@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	Sleep(50);
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@              @              @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@     @@@@@@   @     @@@@     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       @@     @    @@  @@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       @@     @    @@  @@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       @@     @    @@  @@    @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@       @@     @     @@@@     @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@              @              @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	Sleep(50);
	printf("@@@@@@@@@               @              @              @              @              @              @@@@@@@@@@\n");
	printf("@@@@@@@@@   @       @   @     @@@@     @    @@@@@     @    @@@@@     @     @@       @     @@@@@@   @@@@@@@@@@\n");
	printf("@@@@@@@@@   @   @   @   @    @@  @@    @    @@  @@    @    @@  @@    @     @@       @     @@       @@@@@@@@@@\n");
	printf("@@@@@@@@@    @ @ @ @    @    @@  @@    @    @@@@@@    @    @@   @@   @     @@       @     @@@@@    @@@@@@@@@@\n");
	printf("@@@@@@@@@    @ @ @ @    @    @@  @@    @    @@ @@     @    @@  @@    @     @@       @     @@       @@@@@@@@@@\n");
	printf("@@@@@@@@@     @   @     @     @@@@     @    @@  @@    @    @@@@@     @     @@@@@    @     @@@@@@   @@@@@@@@@@\n");
	printf("@@@@@@@@@               @              @              @              @              @              @@@@@@@@@@\n");
	printf("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n");
	printf("\nНажмите любую клавишу, чтобы продолжить...  ");
	_getch();
	system("@cls||clear");
	printf("================================================================================================================\n");
	printf("Правила очень просты:\n");
	printf("Вам нужно угадать скрытое слово (5 букв) за 6 попыток. Чтобы начать, просто введите любое слово в первой строке. \n");
	printf("Если буква угадана правильно и находится в правильном месте, она будет выделена в ");
	printf("\033[0;32mзелёный\033[0m");
	printf(",\nесли буква находится в слове, но не в том месте - в ");
	printf("\033[0;33mжёлтый\033[0m");
	printf(", и если буквы нет в слове, она останется черным.\n");
	printf("================================================================================================================\n");
	printf("Как играть в Wordle?\n\n");
	printf("1) Введите первое слово.\n");
	printf("Чтобы начать, просто введите любое слово из пяти букв, чтобы узнать, какие буквы соответствуют скрытому слову. \nВ общей сложности у вас будет 6 попыток угадать скрытое слово.\n\n");
	printf("2) Узнайте, какие буквы находятся в скрытом слове.\n");
	printf("Если какие-либо буквы отмечены \033[0;33mжёлтым\033[0m, это означает, что эти буквы находится в скрытом слове,\nно не соответствует точному местоположению");
	printf("в этом слове. Если какая-либо буква отмечена \033[0;32mзелёным\033[0m,\nто она находится в этом слове и находится на своём местоположении. Если буква остается черной, \nтогда этой буквы нет в скрытом слове.\n\n");
	printf("3) Попробуйте угадать скрытое слово.\n");
	printf("Теперь, если вы знаете несколько букв с точным расположением (зеленый) и несколько букв, \nкоторые находятся в слове (желтый), вы можете попытаться ");
	printf("разгадать скрытое слово и выиграть игру!\n");
	printf("================================================================================================================\n");
	printf("\nНажмите любую клавишу, чтобы начать угадывать...  ");
	_getch();
	system("@cls||clear");
}